<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

return [
    // +----------------------------------------------------------------------
    // | 应用设置
    // +----------------------------------------------------------------------

    //是否开启权限控制
    'on'=>true,
    //权限控制的类型 1：即时控制   2：登陆权限控制
    'type'=>1,
    //数据表
    'table'=>[
        'user'=>'admin',
        'role'=>'role',
        'node'=>'node',
        'role_has_node'=>'role_has_node',
        'admin_has_role'=>'admin_has_role'
    ],
    //首页例外
    'exception'=>[
        //'home'=>'all',
        'home'=>['index','welcome']
    ],
    //超级管理员
    'super'=>['zhangli'],
];
