<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

return [
    // +----------------------------------------------------------------------
    // | 应用设置
    // +----------------------------------------------------------------------

//替换html中的目录
    'view_replace_str'  =>  [
        '__PUBLIC__'=>'/static/front',
        '__ROOT__' => '/',
    ],
    //加载html中的头尾部
    'template'  =>  [
        'layout_on'     =>  true,
        'layout_name'   =>  'layout/index',
        'layout_item'   =>  '{__REPLACE__}'
    ],
    //首页例外
    'exception'=>[
        //'home'=>'all',
        'home'=>['index','welcome']
    ]
];
